Revit 2027 API
IFCImportOptions.GetExtraOptions Method
 Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetExtraOptions()
Public Function GetExtraOptions As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetExtraOptions()
member GetExtraOptions : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 The list of options.
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace